app/controllers/pieces_controller.rb

 def index
    @pieces = Piece.paginate(:per_page=>9, :page => params[:page])
---
SELECT "pieces".* FROM "pieces" LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "pieces"

  def show
    @piece = Piece.find(params[:id])
---
SELECT "pieces".* FROM "pieces" WHERE "pieces"."id" = ? LIMIT 1  [["id", "1"]]